trb-assignment1/app/concepts/user/operation/show.rb

    def find(ctx, email:, **)
      ctx[:user] = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "raj@test.com"], ["LIMIT", 1]]