trb-assignment1/app/concepts/user/operation/welcome.rb

    def return_data(ctx, token:, **)
      decoded = JsonWebToken.decode(token)
      ctx[:model] = User.find(decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]