trb-assignment1/app/concepts/session/operation/create.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "shweta@gmail.com"], ["LIMIT", 1]]
---
    def find_user(ctx, email:, **)
      ctx[:model] = User.find_by(email: email)