trb-assignment1/app/controllers/application_controller.rb

  def present_user
    if session[:token]
      decoded = JsonWebToken.decode(session[:token])
      puts "in apc==#{session[:token]} id #{decoded}"
      User.find_by(id: decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]